# 平台
PLATFORM = 'MAC'  # MAC WIN

account = '1194332304'

pwdDic = {
    '1194332304': 'mima1325049637', # 绝地求生 cf 王者荣耀 lol
    '1325049637': 'henry123',   # 电视剧 综艺
    '169964440': 'mima1325049637',  # 电影
    '2030657847': 'mima1325049637',  # lol + 王者荣耀
    '3056371919': 'mima1194332304',  # 搞笑 绝地求生 动漫
    '3216598385': 'mima1325049637',  # 王者荣耀
    '3327083625': 'mima1325049637',  # 动漫
    '810359132': 'huang1325049637',  # 游戏动漫
}

# url
LoginURL = 'https://kandian.mp.qq.com/vpage/login'

PubVideoURL = 'https://kandian.mp.qq.com/page/video#video_pub'

# 动漫
Comic33 = [
    '盛世妆娘',
    '魔道祖师',
    '武庚纪',
    '秦时明月',
    '狐妖小红娘',
    '火影忍者',
    '博人传',
    '海贼王',
    '刺客伍六七',
    '天行九歌',
    '骨傲天',
    '我在皇宫当巨巨',
    '西行纪',
]

Comic81 = [
    '蜡笔小新',
    '爆笑虫子',
    '禽兽超人',
    '搞笑小动画', 
    '王者荣耀动漫',
    '峡谷重案组',
    '搞笑动画',
    '吃鸡大作战',
    '火线传奇',
    '非人哉',
]

Comic30 = [
    '一禅小和尚',
    '哆啦A梦',
    '猫和老鼠',
    '憨豆先生动画版'
]

# 游戏
Gamelol = [
    '徐老师来巡山',
    'LOL',
    'lol',
    '英雄联盟',
    '小学生炸了'
]

Gamewz = [
    '王者荣耀',
]

Gamecj = [
    '绝地求生',
    '刺激战场',
]

Gamecj_cf = [
    '绝地求生',
    '刺激战场',
    'CF手游',
    '穿越火线',
]

Games = [
    '徐老师来巡山',
    'LOL',
    'lol',
    '英雄联盟',
    '王者荣耀',
    '绝地求生',
    '刺激战场',
    'CF手游',
    '穿越火线',
]

# Variety 综艺
Variety = [
    '中餐厅',
    '明日之子'
]

# teleplay 电视剧
Teleplay = [
    '扶摇',
    '甜蜜暴击',
    '流星花园',
    '香蜜沉沉烬如霜',
    '香蜜沉沉',
    '延禧攻略',
    '楚乔传',
    '情深深雨濛濛',
    '爱情公寓',
    '还珠格格',
    '爱情进化论',
    '如懿传',
    '泡沫之夏',
    '甄嬛传',
]

# 电影
Movie = [
    '唐人街探案',
    '唐伯虎点秋香',
    '周星驰',
    '成龙',
    '刘德华',
    '周润发',
    '赌侠',
    '赌圣',
    '林正英',
    '让子弹飞',
    '大话西游',
    '人在囧途'
]